cowlove/esp32jimlib/src/jimlib.h
#ifndef INC_JIMLIB_H
#define INC_JIMLIB_H
#include <functional>
#include <string>
#include <string>
#include <sstream>
#include <vector>
#include <iterator>
#include <fcntl.h>
#include <utility>
#include <regex>
#include <cstdint>
#ifndef CSIM
#include "ArduinoOTA.h"
#include "WiFiUdp.h"
#include "driver/adc.h"
#include <rom/uart.h>

// starting jimlib.cpp cleanup
// Sketch uses 1346572 bytes (68%) of program storage space. Maximum is 1966080 bytes.
// real	0m16.728s

#ifdef ESP32
#include <WiFi.h>	
//#include <SPIFFS.h>
#else // ESP32
static inline void ledcSetup(int, int, int) {}
static inline void ledcAttachPin(int, int) {}
static inline void ledcWrite(int, int) {}
#endif //ESP32
#else // !CSIM
#include "ESP32sim_ubuntu.h"
#endif

#include <stdarg.h>
#define DEG2RAD(x) ((x)*M_PI/180)
#define RAD2DEG(x) ((x)*180/M_PI)

using std::vector;
using std::string;
using std::pair;

void wdtInit(int sec);
void wdtReset();
void ledcInit(int pin, int freq, int res, int channel); 

String Sfmt(const char *format, ...);
std::string vsfmt(const char *format, va_list args);
std::string sfmt(const char *format, ...);
//template<typename... Args> std::string strfmt(const char *format, Args... args) { return sfmt(format, args...); }
#define strfmt sfmt 

int scanI2c();
void printPins();

#ifdef ESP32
class FakeMutex {
	public:
	void lock() {}
	void unlock() {}
};

class FakeSemaphore { 
 public:
	FakeSemaphore(int max = 1, int init = 1) {}
	bool take(int delay = 0) { return true; } 
	void give() {}
};

class Mutex {
	SemaphoreHandle_t xSem;
 public:
	Mutex() { 
		xSem = xSemaphoreCreateCounting(1,1);
		unlock();
	}
	void lock() { xSemaphoreTake(xSem, portMAX_DELAY); } 
	void unlock() { xSemaphoreGive(xSem); }
};

class Semaphore { 
	SemaphoreHandle_t xSem;
 public:
	Semaphore(int max = 1, int init = 1) { 
		xSem = xSemaphoreCreateCounting(max, init);
	}
	bool take(int delay = portMAX_DELAY) { return xSemaphoreTake(xSem, delay); } 
	void give() { xSemaphoreGive(xSem); }
	int getCount() { return uxSemaphoreGetCount(xSem); } 
};

class ScopedMutex {
	Mutex *mutex; 
  public:
	ScopedMutex(Mutex &m) : mutex(&m) { mutex->lock(); } 
	ScopedMutex(FakeMutex &m) : mutex(NULL) {} 
	~ScopedMutex() { if (mutex != NULL) mutex->unlock(); } 
};
#endif

class LineBuffer {
public:
	char line[1024];
	char len = 0;
	int add(char c, std::function<void(const char *)> f = NULL);
	void add(const char *b, int n, std::function<void(const char *)> f);
	void add(const uint8_t *b, int n, std::function<void(const char *)> f); 
};

class IntervalTimer {
public: 
	double last, interval;
	IntervalTimer(double i) : interval(i) {}
	bool tick(double now) {
		bool rval = (floor(now / interval) != floor(last / interval));
		last = now;
		return rval;
	}
};

class EggTimer {
	uint64_t last;
	uint64_t interval; 
	bool first = true;
	bool immediate = false;
public:
	EggTimer(float ms, bool imm = false) : interval(ms * 1000), last(0) { 
		reset(imm); 
	}
	bool tick() { 
		uint64_t now = micros();
		if (now - last >= interval || immediate == true) {
			immediate = false; 
			last += interval;
			// reset last to now if more than one full interval behind 
			if (now - last >= interval) 
				last = now;
			return true;
		} 
		return false;
	}
	void reset(bool imm = false) { 
		last = micros();
		immediate = imm;
	}
	void alarmNow() { 
		reset(true);
	}
};
typedef EggTimer Timer;

#ifdef ESP32
std::vector<std::string> split(const std::string &s, char delim);

template <class T>  
class CircularBoundedQueue { 
	Semaphore empty, full;
	int size, head, tail;
	T *array;
public:
	CircularBoundedQueue(int s) : size(s), empty(s, s), full(s, 0) {
		array = new T[size];
		head = tail = 0;
	}
	T *peekHead(int tmo) {
		if (!empty.take(tmo)) 
			return NULL;

		T *rval = &array[head];
		head = (head + 1) % size;
		return rval;
	}
	void postHead() {
		full.give();
	}
	T *peekTail(int tmo) {
		if (!full.take(tmo)) 
			return NULL;

		T *rval = &array[tail];
		tail = (tail + 1) % size;
		return rval;
	}
	void freeTail() {
		empty.give();
	}
	int getCount() { return full.getCount(); } 
};
#endif //#ifdef ESP32

// From data format described in web search "SL30 Installation Manual PDF" 
class SL30 {
public:
        std::string twoenc(unsigned char x) {
			char r[3];
			r[0] = (((x & 0xf0) >> 4) + 0x30);
			r[1] = (x & 0xf) + 0x30;
			r[2] = 0;
			return std::string(r);
        }
        int chksum(const std::string& r) {
			int sum = 0;
			const char* s = r.c_str();
			while (*s)
					sum += *s++;
			return sum & 0xff;
        }
        void open() {}
        std::string pmrrv(const char *r) {
			return std::string("$PMRRV") + r + twoenc(chksum(r)) + "\r\n";
			//Serial2.write(s.c_str());
			//Serial.printf("G5: %s", s.c_str());
			//Serial.write(s.c_str());
		}
        std::string setCDI(double hd, double vd) {
			int flags = 0b11111010;
			hd *= 127 / 3;
			vd *= 127 / 3;
			return pmrrv((std::string("21") + twoenc(hd) + twoenc(vd) + twoenc(flags)).c_str());
        }
};

class PinPulse { 
public:
	int pin;
	uint64_t toggleTime = 0;
	PinPulse(int p, int initval = 0) : pin(p) { pinMode(p, OUTPUT); digitalWrite(p, initval); } 
	void  pulse(int v, int ms) { 
		toggleTime = ms > 0 ? millis() + ms: 0;
		pinMode(pin, OUTPUT);
		digitalWrite(pin, v);
	}
	void run() { 
		if (toggleTime > 0 && millis() >= toggleTime) {
			toggleTime = 0;
			pinMode(pin, OUTPUT);
			digitalWrite(pin, !digitalRead(pin));
		}
	}
};

static inline std::string nmeaChecksum(const std::string &s) { 
	char check = 0;
	for (const char &c : s)  
		check ^= c;
	char buf[8];
	snprintf(buf, sizeof(buf), "*%02X\n", (int)check);
	return std::string("$") + s + std::string(buf);	
}

struct DsTempData { 
	uint64_t id;
	uint64_t time;
	float degC;
};

class OneWireNg; 
std::vector<DsTempData> readTemps(OneWireNg *ow);

static inline const String &basename_strip_ext(const char *fn) {
	static String rval;
	rval = fn; 
	char *p = strrchr((char *)fn, '/');
	if (p != NULL) 
		rval = p + 1;
	if (rval.indexOf('.')) {
		rval = rval.substring(0, rval.indexOf('.'));
	}
	return rval;
}

static inline string &getMacAddress(string &result) {
	static uint8_t baseMac[6] = {0xff};
#ifdef ESP32
	// Get MAC address for WiFi station
	esp_read_mac(baseMac, ESP_MAC_WIFI_STA);
#endif
	static char baseMacChr[32] = {0};
	static String mac;
	snprintf(baseMacChr, sizeof(baseMacChr), "%02X%02X%02X%02X%02X%02X", baseMac[0], baseMac[1], baseMac[2], baseMac[3], baseMac[4], baseMac[5]);
	result = baseMacChr;
	return result;
}

const String &getMacAddress();

template<class T> bool fromString(const string &s, T&v);
template<> inline bool fromString(const string &s, int &v) { return sscanf(s.c_str(), "%d ", &v) == 1; }
template<> inline bool fromString(const string &s, uint64_t &v) { return sscanf(s.c_str(), "%lu ", &v) == 1; }
template<> inline bool fromString(const string &s, uint32_t &v) { return sscanf(s.c_str(), "%u ", &v) == 1; }
template<> inline bool fromString(const string &s, int64_t &v) { return sscanf(s.c_str(), "%ld ", &v) == 1; }
template<> inline bool fromString(const string &s, float &v) { return sscanf(s.c_str(), "%f ", &v) == 1; }
template<> inline bool fromString(const string &s, string &v) { v = s; return true; }
template<> inline bool fromString(const string &s, bool &v) { v = (s == "true"); return true; }

template<class T> string toString(const T&v);
template<> inline string toString(const uint64_t &v) { return sfmt("%lu ", v); }
template<> inline string toString(const uint32_t &v) { return sfmt("%u ", v); }
template<> inline string toString(const int64_t &v) { return sfmt("%ld ", v); }
template<> inline string toString(const int &v) { return sfmt("%d ", v); }
template<> inline string toString(const float &v) { return sfmt("%f ", v); }
template<> inline string toString(const string &v) { return v; }
template<> inline string toString(const bool &v) { return v ? "true" : "false"; }

#define LP() printf("%09.3f %s:%d\n", millis() / 1000.0, basename(__FILE__), __LINE__)
template<> inline bool fromString(const string &s, std::vector<string> &v) { 
	v = split(s, '\n');
	return true; 
}

