cowlove/esp32jimlib/src/jimlib.h
template<> inline string toString(const std::vector<string> &v) { 
	string rval;
	int totalSize = 0;
	for(auto line : v) totalSize += line.length() + 1;
	rval.reserve(totalSize);
    for(auto line : v) rval += line + "\n";
    return rval;
}

//extern int SpiffsInit;
class SPIFFSVariableESP32Base { 
protected:
	SPIFFSVariableESP32Base();
	string filename, defaultStringValue;
	void writeAsString(const string &s);
	string readAsString();	
	static bool initialized;
protected:
	bool successfullyWritten = false;
public:
	bool debug = false;
	static void begin();
};

template<class T> 
class SPIFFSVariableESP32 : public SPIFFSVariableESP32Base { 
	const T def;
	T val;
	bool firstRead = true;
public:
	SPIFFSVariableESP32(const char *f, const T &d) : def(d), val(d) {
		filename = f;
		defaultStringValue = toString(def);
	}
	SPIFFSVariableESP32(const string &f, const T &d) : def(d), val(d) {
		filename = f;
		defaultStringValue = toString(def);
	}
	T read() {
		if (!initialized && debug) {
			printf("WARNING: early read from '%s'\n", filename.c_str());
		}
		if (firstRead) { 
			val = def;
			string s = readAsString();
			fromString(s, val);
			firstRead = false;
		}
		return val;
	}
	operator const T() { return read(); } 
	SPIFFSVariableESP32 & operator=(const T&v) { write(v); return *this; } 
	void write(const T &v) {
		if (!initialized) {
			printf("WARNING: early write to '%s'\n", filename.c_str());
		}
		val = v;
		string s = toString(val);
		this->writeAsString(s);
	}
};

// TODO: I think there is a ESP8266 alternative to the SPIFFS.h, find it 
template<class T> 
struct SPIFFSVariableFake { 
	const T def;
	SPIFFSVariableFake(const char *f, const T &d) : def(d) {}
	operator const T() { return def; } 
	SPIFFSVariableFake & operator=(const T&v) { return *this; }
};

#ifdef ESP32
#define SPIFFSVariable SPIFFSVariableESP32
#else
#define SPIFFSVariable SPIFFSVariableFake
#endif

class JimWiFi { 
	EggTimer report = EggTimer(1000);
	bool firstRun = true, firstConnect = true;
	std::function<void(void)> connectFunc = NULL;
	std::function<void(void)> otaFunc = NULL;
	// TODO: move this into JimWifi
	SPIFFSVariable<int> lastAP = SPIFFSVariable<int>("/lastap", -1);
public:
	struct ApInfo {
		const char *name;
		const char *pass;
		const char *mqtt;
	};
	std::vector<ApInfo> aps = {	{"Ping-582B", "", ""}, 
			{"ChloeNet", "niftyprairie7", ""},
			{"MOF-Guest", "", ""},
			{"ClemmyNet","clementine is a cat", "192.168.68.138"},
			{"ChloeNet4", "niftyprairie7", ""},
			{"Station 54", "Local1747", ""}, 
		};

	bool waitConnected(int ms, int bestMatch = -1) { 
		uint32_t startMs = millis();
		while(millis() - startMs < ms) { 
			if (WiFi.status() == WL_CONNECTED) {
				Serial.printf("Connected\n");
				if (bestMatch >= 0) lastAP = bestMatch;
				return true;
			}
			wdtReset();
			delay(100);
		}
		return false;
	}
	const char *getMqttServer() { 
		if (lastAP >= 0) return aps[lastAP].mqtt;
		return NULL;
	}
	void autoConnect() {
		if (!enabled) 
			return;
		//WiFi.disconnect(true);
		//WiFi.mode(WIFI_STA);
		//WiFi.setSleep(false);
		//delay(100);

		int bestMatch = lastAP;
		if (bestMatch >= 0 && bestMatch < aps.size()) { 
			Serial.printf("Trying cached WiFi AP '%s'...\n", aps[bestMatch].name);
			WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
			if (waitConnected(2000)) return;
			WiFi.disconnect();
			WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
			if (waitConnected(2000)) return;
		}
		bestMatch = -1;

		Serial.println("Scanning...");
		WiFi.disconnect(true);
		//WiFi.mode(WIFI_STA);
		//WiFi.setSleep(false);
		//delay(1000);
		wdtReset();
		int n = WiFi.scanNetworks();
		wdtReset();
		Serial.println("scan done");
		
		if (n == 0) {
			Serial.println("no networks found");
		} else {
			Serial.printf("%d networks found\n", n);
			for (int i = 0; i < n; ++i) {
			// Print SSID and RSSI for each network found
			// TODO handle the trailing space in some AP names 
				Serial.printf("%3d: %s (%d)\n", i + 1, WiFi.SSID(i).c_str(), WiFi.RSSI(i));
				for (int j = 0; j < aps.size(); j++) { 
					if (strcmp(WiFi.SSID(i).c_str(), aps[j].name) == 0) { 
						if (bestMatch == -1 || j < bestMatch) {
							bestMatch = j;
						}
					}
				}	
			}
		}
		if (bestMatch == -1) {
			bestMatch = 0;
		}
		WiFi.scanDelete();
		Serial.printf("Using WiFi AP '%s'...\n", aps[bestMatch].name);
		WiFi.disconnect();
		WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
		if (waitConnected(2000, bestMatch)) return;
		WiFi.disconnect();
		WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
		waitConnected(12000, bestMatch); 
	}
public:
    bool updateInProgress = false;
	bool debug = false;
	bool enabled = true;
	WiFiUDP udp;
	//WiFiMulti wifi;
	EggTimer connCheck = EggTimer(30000);
	void onConnect(std::function<void(void)> oc) { 
		connectFunc = oc;
	}
	void onOTA(std::function<void(void)> oo) { 
		otaFunc = oo;
	}
	void invalidateCachedAP() { 
		lastAP = -1;
	}
	void run() {
		if (!enabled) 
			return;

		if (firstRun) {
			autoConnect();			
			firstRun = false;
		}
		if (firstConnect == false && connCheck.tick() && WiFi.status() != WL_CONNECTED) {
			WiFi.disconnect();
			WiFi.reconnect();
		}
		if (WiFi.status() == WL_CONNECTED) { 
			if (firstConnect ==  true) { 
				firstConnect = false;

				ArduinoOTA.onStart([this]() {
					String type;
					if (this->otaFunc != NULL) { 
						this->otaFunc();
					}
					if (ArduinoOTA.getCommand() == U_FLASH) {
					type = "sketch";
					} else { // U_FS
					type = "filesystem";
					}
					#ifdef ESP32
					//WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); //disable brownout detector   
					#endif

					// NOTE: if updating FS this would be the place to unmount FS using FS.end()
					Serial.println("Start updating " + type);
					});
					ArduinoOTA.onEnd([]() {
					Serial.println("\nEnd");
				});
				ArduinoOTA.onProgress([&](unsigned int progress, unsigned int total) {
						//Serial.printf("Progress: %u%%\n", (progress / (total / 100)));
						wdtReset();
						updateInProgress = true;
						delay(30);
				});
				ArduinoOTA.onError([&](ota_error_t error) {
					Serial.printf("Error[%u]: ", error);
					if (error == OTA_AUTH_ERROR) {
					Serial.println("Auth Failed");
					} else if (error == OTA_BEGIN_ERROR) {
					Serial.println("Begin Failed");
					} else if (error == OTA_CONNECT_ERROR) {
					Serial.println("Connect Failed");
					} else if (error == OTA_RECEIVE_ERROR) {
					Serial.println("Receive Failed");
					} else if (error == OTA_END_ERROR) {
					Serial.println("End Failed");
					}
					updateInProgress = false;
				});
	
				
				ArduinoOTA.begin();

				udp.begin(9999);
				if (connectFunc != NULL) { 
					connectFunc();
				}
			}
		
				
			do {
				ArduinoOTA.handle();
			} while(updateInProgress == true);
//			server.handleClient();
			if (report.tick()) {
				udpDebug(""); 
			}
		}
	}
	bool connected() { return WiFi.status() == WL_CONNECTED;  }  
	void udpDebug(const char *s) { 
		if (!connected() || !debug)
			return;
		udp.beginPacket("255.255.255.255", 9000);
		char b[128];
		snprintf(b, sizeof(b), "%08d %s %s " __DATE__ "   " __TIME__ "   %s ", 
			(int)(millis() / 1000), WiFi.localIP().toString().c_str(), 
			basename_strip_ext(__BASE_FILE__).c_str(), getMacAddress().c_str());
		udp.write((const uint8_t *)b, strlen(b));
		udp.write((const uint8_t *)s, strlen(s));
		udp.write((const uint8_t *)"\n", 1);
		udp.endPacket();
	}
};

#ifdef CSIM
#include <fcntl.h>
#include <unistd.h>
#endif

#ifndef ESP32

class ShortBootDebugMode {
	SPIFFSVariable<int> shortBootCount = SPIFFSVariable<int>("/shortBootCount", 1);
	bool initialized = false;
	bool cleared = false;
	int sbCount; 
	int threshold;
  public:
	ShortBootDebugMode(int t) : threshold(t) {}
	void begin() {
		shortBootCount = shortBootCount + 1;
		sbCount = shortBootCount;
		
