cowlove/esp32jimlib/src/jimlib.h
		Serial.printf("Short boot count %d\n", sbCount);
		initialized = true;
	}
	bool check() {
		if (initialized == false) { 
			begin();
		}
		if (millis() > 5000 && cleared == false) { 
			cleared = true;
			shortBootCount = 0 ;
		}
		return sbCount >= threshold;
	} 
};
#endif // ESP32

template<class T>
class ExtrapolationTable {
        bool between(T a, T b, T c) { 
                return (c >= a && c < b) || (c <= a && c > b);
        }
public:
        struct Pair {
             T a,b;        
        } *table;
        ExtrapolationTable(struct Pair *t) : table(t) {}
        T extrapolate(T in, bool reverse = false) {
                for(int index = 1; table[index].a != -1 || table[index].b != -1; index++) {     
                        if (!reverse && between(table[index - 1].a, table[index].a, in))  
                                return table[index - 1].b + (in - table[index - 1].a) 
                                        * (table[index].b - table[index - 1].b) 
                                        / (table[index].a - table[index - 1].a);
                        if (reverse && between(table[index - 1].b, table[index].b, in)) 
                                return table[index - 1].a + (in - table[index - 1].b) 
                                        * (table[index].a - table[index - 1].a) 
                                        / (table[index].b - table[index - 1].b);                
          
                }
                return -1;
        }
        T operator () (T in) { return extrapolate(in); }
};

static const float FEET_PER_METER = 3.28084;
static const float MPS_PER_KNOT = 0.51444;

inline float random01() { 	return rand() / (RAND_MAX + 1.0); }
#define ARRAY_SIZE(array) (sizeof(array)/sizeof(array[0]))
#ifndef GIT_VERSION
#define GIT_VERSION "unknown-git-version"
#endif


static inline float avgAnalogRead(int p, int avg = 1024) { 
	float bv = 0;
	pinMode(p, INPUT);
	for (int i = 0; i < avg; i++) {
#ifdef ARDUINO_ESP32S3_DEV
		if (p == 1) bv += adc1_get_raw(ADC1_CHANNEL_0);
		if (p == 2) bv += adc1_get_raw(ADC1_CHANNEL_1);
		if (p == 3) bv += adc1_get_raw(ADC1_CHANNEL_2);
		if (p == 4) bv += adc1_get_raw(ADC1_CHANNEL_3);
#else
		bv += analogRead(p);
#endif
	}
	return bv / avg;
}

static inline void bin2hex(const char *in, int len, char *out, int olen) {
	len = min(len, olen / 2); 
	for (int n = 0; n < len; n++) { 
		sprintf(out + 2 * n, "%02x", in[n]);
	}
	out[2 * len] = '\0';
}

static inline int hex2bin(const char *in, char *out, int inLength) { 
        for (const char *p = in; p < in + inLength ; p += 2) { 
                char b[3];
                b[0] = p[0];
                b[1] = p[1];
                b[2] = 0;
                int c;
                sscanf(b, "%x", &c);
                *(out++) = c;
        }
        return inLength / 2;
}

void webUpgrade(const char *u);

// create a String from a char buf without NULL termination 
static inline String buf2str(const byte *buf, int len) { 
  String s;
  for (int i = 0; i < len; i++) {
	s += (char)buf[i];
  }
  return s;
}

// connects to an mqtt server, publish stuff on <name>, subscribe to <name>/in
class PubSubClient;
class MQTTClient { 
	WiFiClient espClient;
	void callBack(char *topic, byte *p, unsigned int l);
	std::function<void(String,String)> userCallback = NULL;
	PubSubClient *client = NULL;
public:
    String topicPrefix, server;
	bool active;
	void setCallback(std::function<void(String,String)> cb) { userCallback = cb; }
	void begin(const char *s, const char *t, std::function<void(String,String)> cb = NULL, bool a = true);
	MQTTClient();
	void publish(const char *suffix, const char *m);
	void publish(const char *suffix, const String &m);
	void pub(const char *m);
	void reconnect();
	void dprintf(const char *format, ...);
	void run();
};

int getLedPin();


class PwmChannel {
	int pin; 
	int channel;
	int pwm = -1;
public:		
	int gradual;
	PwmChannel(int p, int hz = 50, int c = 0, int g = 0) : pin(p), channel(c), gradual(g) {
		//ledcSetup(channel, hz, 16);
		//ledcAttachPin(pin, channel);
		ledcInit(pin, hz, 16, channel);
	}
	void setMs(int p) { set(p * 4715 / 1500); };
	void setPercent(int p) { set(p * 65535 / 100); } 
	void setRaw(int p) { 
		while(gradual && pwm > 0 && pwm != p && pwm < 65536 ) { 
			pwm += pwm < p ? 1 : -1;
			ledcWrite(channel, pwm);  
			delayMicroseconds(gradual);
		}
		ledcWrite(channel, p); 
		pwm = p; 
	} 
	void set(int p) {  
		pattern = 0;
		setRaw(p);
	}
	float get() { return (float)pwm / 65535; } 

	int patternPeriod = 0, pattern = 0, patternLen = 0, patternCount = 0;
	float patternBrightness = 1.0, patternSoftness = 0;
	int lastPatIdx = 0, patternFudgeMs = 0;
	void setPattern(int ms, int pat, float bright = 1.0, int count =-1) { 				
		patternPeriod = ms;
		pattern = pat;
		patternLen = 0;
		patternCount = count;
		patternBrightness = bright;
		lastPatIdx = 0;
		while(pat) { 
			patternLen++;
			pat = pat >> 1;
		}
		patternFudgeMs = millis() % (patternPeriod * patternLen);
	}
	void run() { // not reentrant, this can crash if isr routines call setPattern() during loop()->run()
		if (patternPeriod == 0 || pattern == 0)
			return;
		int pat = pattern;
		int pi = ((millis() - patternFudgeMs) % (patternPeriod * patternLen)) / patternPeriod;
		for (int n = 0; n < min(16, pi); n++) { 
			pat= pat >> 1;
		}
		if (pat & 0x1) { 
			float v = abs((int)(millis() % patternPeriod) - patternPeriod/2.0) / (patternPeriod / 2.0 / 100);
			v = min(100.0, max(0.0, 100.0 - v * patternBrightness));
			setRaw(v * 65535 / 100);
		} else { 
			setRaw(0);
		}
		if (pi == 0 && lastPatIdx != 0 && patternCount > 0 && --patternCount == 0) {
			pattern = patternPeriod = patternCount = 0;
			set(0);
		}
		lastPatIdx = pi;
	}
};

#if 1 // TODO - this could move back to supporting ESP8266
using std::smatch;

// TODO: replace "get xxx" hook with making = and white space optional in 
// "set xxx" hook, just use "set xxx" to show command
// TODO: use case insensitive regex matches

class CommandLineInterfaceESP32 { 
	typedef std::function<string(const char *,std::smatch)> callback;
	std::vector<std::pair<std::string, callback>> handlers;
public:

	CommandLineInterfaceESP32() {}

	void on(const char *pat, callback h) { 
		handlers.push_back(std::pair<std::string, callback>(pat, h));
	}
	void on(const char *pat, std::function<void()> f) { 
		on(pat, [f](const char *, std::smatch) { f(); return string(); });
	}
	void on(const char *pat, std::function<void(std::smatch)> f) { 
		on(pat, [f](const char *, std::smatch m) { f(m); return string(); });
	}
	void on(const char *pat, std::function<void(const char *l)> f) { 
		on(pat, [f](const char *l, std::smatch) { f(l); return string(); });
	}
	string process(const char *line) {
		string rval = ""; 
		if (strstr(line, "hooks")) { 
			smatch dummy;
			for(auto i = handlers.begin() + 1; i != handlers.end(); i++) { 
				rval += i->first + " \t " + i->second("", dummy) + "\n";
			}
			return rval;
		}
		for(auto i = handlers.begin(); i != handlers.end(); i++) { 
			std::smatch res;
			std::regex exp((i->first).c_str(), std::regex::icase);
			std::string str = line;
			if (std::regex_match(str, res, exp))  
				rval += i->second(line, res);
		}
		return rval;
	}
	template<typename T>
	void hookRaw(const char *pat, T* v) {
		const char *fmt = formatOf<T>();
		on(pat, [v,fmt](const char *, smatch m) { 
			if (m.size() > 1) 
				sscanf(m.str(1).c_str(), fmt, v);
			return strfmt(fmt, *v);
		});
	}

