cowlove/esp32jimlib/src/jimlib.h
	template<typename T>
	void hookVar(const char *l, T*p) {
		std::string s = strfmt("set %s[= ]*(.*)", l); // TODO make = optional 
		hookRaw(s.c_str(), p);
		//s = strfmt("get %s", l);
		//hookRaw(s.c_str(), p);	
	}

	template<typename T> const char *formatOf();
};

template<> inline const char *CommandLineInterfaceESP32::formatOf<float>() { return "%f"; }
template<> inline const char *CommandLineInterfaceESP32::formatOf<int>() { return "%i"; }
template<> inline const char *CommandLineInterfaceESP32::formatOf<unsigned int>() { return "%x"; }

template<>
inline void CommandLineInterfaceESP32::hookRaw<string>(const char *pat, string *v) {
	on(pat, [v](const char *, smatch m) { 
		if (m.size() > 1 && m.str(1).length() > 0)
			*v = m.str(1).c_str();
		return string(*v);
	});
}
template<>
inline void CommandLineInterfaceESP32::hookRaw<String>(const char *pat, String *v) {
	on(pat, [v](const char *, smatch m) { 
		if (m.size() > 1 && m.str(1).length() > 0)
			*v = m.str(1).c_str();
		return string((*v).c_str());
	});
}


// TODO: need to reimplement this without std::regex so that ESP8266 can still fit in OTA
struct CommandLineInterfaceESP8266 { 
	typedef std::function<string(const char *,std::smatch)> callback;
	void run();
	void begin();
	void on(const char *pat, callback h) {}
	void on(const char *pat, std::function<void()> f) {}
	void on(const char *pat, std::function<void(std::smatch)> f) {}
	void on(const char *pat, std::function<void(const char *l)> f) {}
	string process(const char *line) {
		string s = "TODO: CommandLineInterfaceESP8266 not implemented, ignoring: ";
		s += line;
		//mqtt.pub(s.c_str());
		Serial.print(s.c_str()); 
		return s; 
	}
	template<typename T>
	void hookVar(const char *l, T*p) {}
};

#ifdef ESP32
typedef CommandLineInterfaceESP32 CommandLineInterface;
#else
typedef CommandLineInterfaceESP8266 CommandLineInterface;
#endif

template<typename T> 
class CliVariable {
	T val;
  public:
	CliVariable(CommandLineInterface &c, const char *n) { c.hookVar(n, &val); }
	CliVariable(CommandLineInterface &c, const char *n, T v) : val(v) { c.hookVar(n, &val); }
	operator T&() { return val; }
	T& operator =(T v) { val = v; return val; } 
};


class QuickRebootCounter {
	SPIFFSVariable<int> count = SPIFFSVariable<int>("/quickRebootCount", 0); 
	SPIFFSVariable<int> pending = SPIFFSVariable<int>("/quickRebootPending", 0); 
public:
	QuickRebootCounter() { 
		if (pending == 1) count = count + 1;
		pending = 1;
	}
	void run() { 
		if (millis() > 1000) {
			count = 0; pending = 0; 
		}
	}
	int reboots() { return count; }
};


#define CLI_VARIABLE_INT(name,val) CliVariable<int> name = CliVariable<int>(j.cli, #name, val)
#define CLI_VARIABLE_FLOAT(name,val) CliVariable<float> name = CliVariable<float>(j.cli, #name, val)
#define CLI_VARIABLE_STRING(name,val) CliVariable<String> name = CliVariable<String>(j.cli, #name, val)
#define CLI_VARIABLE_HEXINT(name,val) CliVariable<unsigned int> name = CliVariable<unsigned int>(j.cli, #name, val)

class JStuff {		
public:
	bool parseSerial;
	bool beginRan = false;
	std::function<void()> onConn = NULL;
	LineBuffer lb;
	bool debug = false;
	CommandLineInterface cli;
	CliVariable<int> logLevel;
	//QuickRebootCounter quickRebootCounter;
public:
	//PwmChannel led = PwmChannel(getLedPin(), 1024, 10, 2);
	struct {
		void run() {}
		void setPattern(int, int) {}
		void setPercent(int) {}
	} led;
	JStuff(bool ps = true) : parseSerial(ps), logLevel(cli, "logLevel", 1) {
		cli.on("DEBUG", [this]() { 
			jw.debug = debug = true; 
		});
	}
	uint64_t thisRun, lastRun;
	bool forceTicksNow = false; 
	bool hz(float hz) { 
		int us = 1000000.0 / hz;
		return forceTicksNow || (thisRun / us != lastRun / us);
	}
	bool secTick(float sec) { 
		return 
		hz(1.0/sec);
	}
	void forceTicks() { forceTicksNow = true; }

	bool onceFlag = true;
	bool once() { 
		bool rval = onceFlag;
		onceFlag = false;
		return rval;
	}

	bool cliEcho = true;
	JimWiFi jw;
	MQTTClient mqtt;
	void run() { 
		if (beginRan == false)
			begin();
		//quickRebootCounter.run();
		lastRun = thisRun;
		thisRun = micros();
		forceTicksNow = false;

		wdtReset();
		jw.run(); 
		wdtReset();
		mqtt.run(); 
		led.run();
		while(parseSerial == true && Serial.available()) { 
			lb.add(Serial.read(), [this](const char *l) {
				string r = cli.process(l);
				if (cliEcho) 
					Serial.println(r.c_str());
			});
		}
	}
	void begin() { 
		beginRan = true;
		wdtInit(15);
		SPIFFSVariableESP32Base::begin();

		Serial.begin(115200);
		Serial.printf("BOOT %s git:" GIT_VERSION " mac:%s time:%05.3fs built:" __DATE__ " " __TIME__ " \n", 
			basename_strip_ext(__BASE_FILE__).c_str(), getMacAddress().c_str(), millis() / 1000.0);
		getLedPin();
		//led.setPercent(30);
		jw.onConnect([this](){
			led.setPattern(500, 2);
			const char *mqttServer = jw.getMqttServer();
			if (mqttServer != NULL && strlen(mqttServer)) {
				 mqtt.begin(mqttServer, basename_strip_ext(__BASE_FILE__).c_str());
			}
			if (WiFi.SSID() == "ClemmyNet" || WiFi.SSID() == "FakeWiFi") {
				jw.debug = mqtt.active = true;  
				out("JStuff: forcing debug and mqtt.active due to WiFi network");
 			}
			Serial.printf("Connected to AP '%s' in %dms, IP=%s, channel=%d, RSSI=%d\n",
				WiFi.SSID().c_str(), millis(), WiFi.localIP().toString().c_str(), WiFi.channel(), WiFi.RSSI());
			if (onConn != NULL) { 
				onConn();
			}
		});
		mqtt.setCallback([this](String t, String m) {
			string r = cli.process(m.c_str());
			if (cliEcho) 
				mqtt.pub(r.c_str());
		});
	}
	void out(const string &s) { 
		mqtt.pub(s.c_str());
		printf("%s", s.c_str());
		printf("\n");
		jw.udpDebug(s.c_str());
	}
	void out(const char *format, ...) { 
		va_list args;
		va_start(args, format);
		string s = vsfmt(format, args);
		va_end(args);
		out(s);
	}
	void log(int ll, const char *format, ...) { 
		if (logLevel < ll) 
			return; 
		va_list args;
		va_start(args, format);
		string s = vsfmt(format, args);
		va_end(args);
		mqtt.pub(s.c_str());
		Serial.println(s.c_str());
		//jw.udpDebug(buf);
	}
	void log(int l, String s) { log(l, s.c_str()); }
	void log(int l, std::string s) { log(l, s.c_str()); }
	void out(String s) { string s2 = s.c_str(); out(s2); }
};

//#define OUT j.out
//#define LOG j.log

#endif

#if 0 // should work, just move to jimlib.cpp
class TempSensor { 
	public:
	#define OWNG OneWireNg_CurrentPlatform 
	OWNG *ow = NULL; 
	TempSensor(OWNG *p) : ow(p) {}
	TempSensor(int pin, bool pullup = true) {
		ow = new OWNG(pin, pullup);
	}
	float readTemp(int retries = 5) { 
		for(int i = 0; i < retries; i++) { 
			std::vector<DsTempData> t = readTemps(ow);
			if (t.size() > 0) {
				return t[0].degC;
			}
		}	
		return -999.0;
	}
};
#endif 

static inline void digitalToggle(int pin) { pinMode(pin, OUTPUT); digitalWrite(pin, !digitalRead(pin)); }

// registers SETTEMP, CURRENTTEMP, HIST commands with CLI.  Returns heat on/off
// value from check() function 
class CliTempControl {
public:
	CliVariable<float> setTemp;
	CliVariable<float> currentTemp;
	CliVariable<float> hist;
	CliVariable<int> heat;
	CliVariable<float> minTemp;
	JStuff *j;

	CliTempControl(JStuff *js, float temp, float h) :
		j(js), setTemp(js->cli, "setTemp", temp),
		currentTemp(js->cli, "currentTemp", temp), 
		hist(js->cli, "hist", h),
		heat(js->cli, "heat", 0),
		minTemp(js->cli, "minTemp", 5) {}

	bool check(float temp) { 
		currentTemp = temp;
		if (temp > setTemp) { 
			heat = 0;
		} else if (temp >= minTemp && temp < setTemp - hist) { 
			heat = 1;
		}
		return heat;
	}	
	void pub() { 
		j->out("setTemp: %6.2f currentTemp: %6.2f heat: %d", (float)setTemp, (float)currentTemp, (int)heat);
	}
};

#define PRINTLINE() if(1) { printf("%09.3f " __FILE__ " line %d\n", millis() / 1000.0, __LINE__); } 

