cowlove/esp32jimlib/src/jimlib.h
const char *reset_reason_string(int reason);

class HzTimer { 
public:
	HzTimer(float h, bool forceFirst = true) : force(forceFirst), hertz(h) {}
	bool force;
	float hertz;
	uint32_t last = 0;
	bool hz(float h) {
		bool rval = force || (millis() - last) > 1000.0 / h;
			if (rval) {
				last = millis();
				force = false;
			}
		return rval;
	}
	bool tick() { return hz(hertz); }
	bool secTick(float sec) { return sec > 0 ? hz(1/sec) : true; }
};
	
int getResetReason(int cpu = 0);

class DeepSleepManager { 
	typedef std::function<void(uint32_t)> Callback;
	vector<Callback> callbacks; 	
public:
	void onDeepSleep(Callback f) { 
		callbacks.push_back(f); 
	}
	void prepareSleep(uint32_t ms) {
		for(auto f : callbacks) f(ms);
	}
	void deepSleep(uint32_t ms);
};

extern JStuff j;

static inline void wifiDisconnect() { 
    WiFi.disconnect();
    WiFi.mode(WIFI_OFF);
    j.jw.enabled = false;
}

static inline bool wifiConnect() { 
    wifiDisconnect(); 
	printf("Connecting...\n");
    j.jw.enabled = true;
    j.mqtt.active = false;
    j.jw.onConnect([](){});
    j.jw.autoConnect();
    for(int i = 0; i < 20 && WiFi.status() != WL_CONNECTED; i++) { 
        delay(500);
        wdtReset();
    }
    String ssid = WiFi.SSID(), ip = WiFi.localIP().toString();
    printf("Connected to AP '%s', IP=%s, channel=%d, RSSI=%d\n",
        ssid.c_str(), ip.c_str(), WiFi.channel(), WiFi.RSSI());
    return WiFi.status() == WL_CONNECTED;
}

extern DeepSleepManager &dsm();
static inline void deepSleep(uint32_t ms) { dsm().deepSleep(ms); }

class DeepSleepElapsedTimer { 
	static const int typicalBootTimeMs = 500;
    SPIFFSVariable<uint32_t> bootOffsetMs, startTs; 
    bool initialized = false, startExpired;
	string prefix;
	void checkInit();
public:
    DeepSleepElapsedTimer(const string &_prefix, bool _startExpired = false);
	void prepareSleep(uint32_t ms);
	uint32_t millis();
	void set(uint32_t ms);
	uint32_t elapsed() { return this->millis(); }
    void reset() { set(0); }
};

static inline float round(float f, float prec) {
    return floor(f / prec + .5) * prec;
}

const char *reset_reason_string(int reason);

//#endif
#endif //#ifndef INC_JIMLIB_H
